#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod]
time_sleep.wait_rg: Refreshing state... [id=2025-09-16T19:20:06Z]
module.vnet.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod]
time_sleep.wait_vnet: Refreshing state... [id=2025-09-16T19:20:41Z]
module.subnets.azurerm_subnet.web: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/web-subnet]
module.subnets.azurerm_subnet.app: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/app-subnet]
module.subnets.azurerm_public_ip_prefix.nat: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/publicIPPrefixes/quotesapp-pipprefix]
module.subnets.azurerm_subnet.pe: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/pe-subnet]
module.subnets.azurerm_nat_gateway.nat: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/natGateways/quotesapp-nat]
module.subnets.azurerm_subnet.db: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/db-subnet]
module.subnets.azurerm_subnet.mgmt: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/mgmt-subnet]
module.subnets.azurerm_network_security_group.web_nsg: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/networkSecurityGroups/web-nsg]
module.subnets.azurerm_subnet_network_security_group_association.web_association: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/web-subnet]
module.subnets.time_sleep.wait_nat: Refreshing state... [id=2025-09-16T19:21:23Z]
module.subnets.azurerm_nat_gateway_public_ip_prefix_association.nat: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/natGateways/quotesapp-nat|/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/publicIPPrefixes/quotesapp-pipprefix]
module.subnets.azurerm_subnet_nat_gateway_association.app_nat: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/app-subnet]
module.sql.time_sleep.wait_for_sql: Refreshing state... [id=2025-09-16T19:24:41Z]
module.sql.data.azurerm_key_vault.key_vault: Reading...
module.acr.azurerm_private_dns_zone.acr_dns: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io]
module.acr.azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.ContainerRegistry/registries/quotesappacrprod]
module.sql.azurerm_private_dns_zone.sql_dns: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateDnsZones/privatelink.database.windows.net]
module.sql.data.azurerm_key_vault.key_vault: Read complete after 0s [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/terraform-backend-rg/providers/Microsoft.KeyVault/vaults/quotesappprodkv]
module.sql.data.azurerm_key_vault_secret.sql_admin_password: Reading...
module.sql.data.azurerm_key_vault_secret.sql_admin_login: Reading...
module.sql.azurerm_private_dns_zone_virtual_network_link.sql_dns_link: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateDnsZones/privatelink.database.windows.net/virtualNetworkLinks/sql-dns-link-quotesapp]
module.acr.azurerm_private_dns_zone_virtual_network_link.acr_dns_link: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io/virtualNetworkLinks/acr-dns-link-quotesapp]
module.acr.azurerm_private_endpoint.acr_pe: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateEndpoints/acr-pe-quotesapp]
module.sql.data.azurerm_key_vault_secret.sql_admin_login: Read complete after 1s [id=https://quotesappprodkv.vault.azure.net/secrets/SQL-QUOTES-APP-PROD-ADMIN-LOGIN/d90a620fbb7a4e2a87fc835b5dd0b82c]
module.sql.data.azurerm_key_vault_secret.sql_admin_password: Read complete after 1s [id=https://quotesappprodkv.vault.azure.net/secrets/SQL-QUOTES-APP-PROD-ADMIN-PASSWORD/536547480bbd40e08008a44045e54c5e]
module.sql.azurerm_mssql_server.sql_server: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Sql/servers/sqlserver-quotesapp-prod]
module.sql.azurerm_private_endpoint.sql_pe: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateEndpoints/sql-pe-quotesapp]
module.sql.azurerm_mssql_database.sql_database: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Sql/servers/sqlserver-quotesapp-prod/databases/sqldb-quotesapp-prod]
module.app_service.azurerm_service_plan.service_plan: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Web/serverFarms/service-plan-quotesapp-prod]
module.app_service.azurerm_private_dns_zone.appservice_dns: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net]
module.app_service.azurerm_linux_web_app.webapp: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Web/sites/webapp-quotesapp-prod]
module.app_service.azurerm_private_dns_zone_virtual_network_link.appservice_dns_link: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net/virtualNetworkLinks/app-dns-link-quotesapp]
module.app_service.azurerm_role_assignment.acr_pull: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.ContainerRegistry/registries/quotesappacrprod/providers/Microsoft.Authorization/roleAssignments/69cf6c6c-975e-74a7-41d6-4b24bd1f71c8]
module.app_service.azurerm_private_endpoint.app_pe: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateEndpoints/app-pe-quotesapp]
module.certificate.azurerm_key_vault_certificate.ssl_cert: Refreshing state... [id=https://quotesappprodkv.vault.azure.net/certificates/cert-appgateway-quotesapp/905e0e40e9984472a53d036b66505341]
module.application_gateway.azurerm_user_assigned_identity.appgw_identity: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.ManagedIdentity/userAssignedIdentities/appgw_identity_quotesapp]
module.application_gateway.azurerm_public_ip.pip: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/publicIPAddresses/pip-appgateway-quotesapp]
module.application_gateway.azurerm_role_assignment.appgw_kv_secret_access: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/terraform-backend-rg/providers/Microsoft.KeyVault/vaults/quotesappprodkv/providers/Microsoft.Authorization/roleAssignments/abf37b8f-b251-47d2-f1fc-65fdfa1b3adf]
module.application_gateway.azurerm_application_gateway.application_gateway: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/applicationGateways/appgateway-quotesapp]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.app_service.data.azurerm_key_vault.key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = (sensitive value)
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + rbac_authorization_enabled      = (known after apply)
      + resource_group_name             = (sensitive value)
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.app_service.data.azurerm_key_vault_secret.db_user_login will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "db_user_login" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "SQL-QUOTES-APP-PROD-DB-USER-LOGIN"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # module.app_service.data.azurerm_key_vault_secret.db_user_password will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "db_user_password" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "SQL-QUOTES-APP-PROD-DB-USER-PASSWORD"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # module.app_service.azurerm_linux_web_app.webapp will be updated in-place
  ~ resource "azurerm_linux_web_app" "webapp" {
      ~ app_settings                                   = {
          - "DB_HOST"       = "sqlserver-quotesapp-prod.database.windows.net"
          - "DB_NAME"       = "sqldb-quotesapp-prod"
          - "DB_PASS"       = (sensitive value)
          - "DB_PORT"       = "1433"
          - "DB_USER"       = (sensitive value)
          - "NODE_ENV"      = "production"
          - "WEBSITES_PORT" = "8080"
        } -> (known after apply)
        id                                             = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Web/sites/webapp-quotesapp-prod"
        name                                           = "webapp-quotesapp-prod"
        tags                                           = {
            "Environment" = "Production"
            "Owner"       = "Rahul"
            "Project"     = "QuotesApp"
        }
        # (26 unchanged attributes hidden)

      ~ site_config {
            # (28 unchanged attributes hidden)

          ~ application_stack {
              + docker_image_name        = "quotesapp:latest"
              + docker_registry_url      = "https://quotesappacrprod.azurecr.io"
                # (11 unchanged attributes hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.app_service.azurerm_service_plan.service_plan will be updated in-place
  ~ resource "azurerm_service_plan" "service_plan" {
        id                              = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Web/serverFarms/service-plan-quotesapp-prod"
        name                            = "service-plan-quotesapp-prod"
      ~ sku_name                        = "S1" -> "B1"
        tags                            = {
            "Environment" = "Production"
            "Owner"       = "Rahul"
            "Project"     = "QuotesApp"
        }
        # (11 unchanged attributes hidden)
    }

  # module.application_gateway.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.application_gateway.data.azurerm_key_vault.key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "quotesappprodkv"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + rbac_authorization_enabled      = (known after apply)
      + resource_group_name             = "terraform-backend-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.application_gateway.azurerm_application_gateway.application_gateway will be updated in-place
  ~ resource "azurerm_application_gateway" "application_gateway" {
        id                                = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/applicationGateways/appgateway-quotesapp"
        name                              = "appgateway-quotesapp"
        tags                              = {
            "Environment" = "Production"
            "Owner"       = "Rahul"
            "Project"     = "QuotesApp"
        }
        # (8 unchanged attributes hidden)

      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

        # (11 unchanged blocks hidden)
    }

  # module.application_gateway.azurerm_role_assignment.appgw_kv_secret_access must be replaced
-/+ resource "azurerm_role_assignment" "appgw_kv_secret_access" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/terraform-backend-rg/providers/Microsoft.KeyVault/vaults/quotesappprodkv/providers/Microsoft.Authorization/roleAssignments/abf37b8f-b251-47d2-f1fc-65fdfa1b3adf" -> (known after apply)
      ~ name                                   = "abf37b8f-b251-47d2-f1fc-65fdfa1b3adf" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      ~ scope                                  = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/terraform-backend-rg/providers/Microsoft.KeyVault/vaults/quotesappprodkv" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.certificate.data.azurerm_key_vault.key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "quotesappprodkv"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + rbac_authorization_enabled      = (known after apply)
      + resource_group_name             = "terraform-backend-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.certificate.azurerm_key_vault_certificate.ssl_cert must be replaced
-/+ resource "azurerm_key_vault_certificate" "ssl_cert" {
      ~ certificate_attribute           = [
          - {
              - created        = "2025-09-16T19:29:38Z"
              - enabled        = true
              - expires        = "2026-09-16T19:29:38Z"
              - not_before     = "2025-09-16T19:19:38Z"
              - recovery_level = "CustomizedRecoverable+Purgeable"
              - updated        = "2025-09-16T19:29:38Z"
            },
        ] -> (known after apply)
      ~ certificate_data                = "3082037C30820264A00302010202105220012462C047F19A68C513B1881F57300D06092A864886F70D01010B0500303031123010060355040A1309526168756C204F7267311A3018060355040313116170702E71756F7465736170702E636F6D301E170D3235303931363139313933385A170D3236303931363139323933385A303031123010060355040A1309526168756C204F7267311A3018060355040313116170702E71756F7465736170702E636F6D30820122300D06092A864886F70D01010105000382010F003082010A0282010100FAC51247F835D87B1A49B063964E74C302B6CF3A06568F9A9AFFA9A70B0E65969DB3A7E98161E4050A4577949EABC1553E7E3EFD0301479D19E217A5E92084CD064575A851965C76388074DB81E0EC41D6DE06AC547FF9523D529D4A23964907A94BAC4A2226588EA7494F9F0CA286B05F7232E4C8F1C2507717EA428463E361E58BDC3C5C6D94B6D34CFFFEBC6CB1DD6AA81F57F8E3431852F684D6E6B0FE58F1D2E402AA54613FB9FCB2C3F9F1C5B8C0E0FBA70A74AC999391334EEE3DC0223569F6E89341521C12340DD1F45EB07BA7586A7892FC862818F89FDB613EB1131673E31861E53E836394157FDF1A0A9B60D0D982827A52787ECD57A21E1DD4310203010001A3819130818E300E0603551D0F0101FF0404030205A030090603551D130402300030130603551D25040C300A06082B06010505070301301C0603551D110415301382116170702E71756F7465736170702E636F6D301F0603551D23041830168014A60FE110D8698ACE39AD581A68B3C003C8C83429301D0603551D0E04160414A60FE110D8698ACE39AD581A68B3C003C8C83429300D06092A864886F70D01010B050003820101006C7EF8B64854BDA5C527B4E1C1433A63894E1ADF2DE2C030FBB66A161FD7F67F4706D9279A72B8761711C4789A0850F5AF6797DF2C3EFDCA6DF36EB4228D06CCE74F7F5FC7D0F5E81DFA826417A9023D3080DFAF7497288CBA69F3A0A42C0A9BCEEFE3985D6A97783A32F15905421A3DB6D921FE347193D2844B2C6F7E737DA321CBF6155B00B3B9F0D60B626EF96E8792830F92509389705EFEBF7F6D00EBA26A378334C31A50F478B1AC6B91D40B10071D945850A0C0B871EED4258D3A8E88B51B3124FCE5779FCC3959B779782862861A0AEDEBF3278FD9A891F34D76CE824DD1920BC36F707CEED95DAA6BC8DD80FB88E65DC333862E3B6EBF23048AEF5D" -> (known after apply)
      ~ certificate_data_base64         = "MIIDfDCCAmSgAwIBAgIQUiABJGLAR/GaaMUTsYgfVzANBgkqhkiG9w0BAQsFADAwMRIwEAYDVQQKEwlSYWh1bCBPcmcxGjAYBgNVBAMTEWFwcC5xdW90ZXNhcHAuY29tMB4XDTI1MDkxNjE5MTkzOFoXDTI2MDkxNjE5MjkzOFowMDESMBAGA1UEChMJUmFodWwgT3JnMRowGAYDVQQDExFhcHAucXVvdGVzYXBwLmNvbTCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAPrFEkf4Ndh7GkmwY5ZOdMMCts86BlaPmpr/qacLDmWWnbOn6YFh5AUKRXeUnqvBVT5+Pv0DAUedGeIXpekghM0GRXWoUZZcdjiAdNuB4OxB1t4GrFR/+VI9Up1KI5ZJB6lLrEoiJliOp0lPnwyihrBfcjLkyPHCUHcX6kKEY+Nh5YvcPFxtlLbTTP/+vGyx3WqoH1f440MYUvaE1uaw/ljx0uQCqlRhP7n8ssP58cW4wOD7pwp0rJmTkTNO7j3AIjVp9uiTQVIcEjQN0fResHunWGp4kvyGKBj4n9thPrETFnPjGGHlPoNjlBV/3xoKm2DQ2YKCelJ4fs1Xoh4d1DECAwEAAaOBkTCBjjAOBgNVHQ8BAf8EBAMCBaAwCQYDVR0TBAIwADATBgNVHSUEDDAKBggrBgEFBQcDATAcBgNVHREEFTATghFhcHAucXVvdGVzYXBwLmNvbTAfBgNVHSMEGDAWgBSmD+EQ2GmKzjmtWBpos8ADyMg0KTAdBgNVHQ4EFgQUpg/hENhpis45rVgaaLPAA8jINCkwDQYJKoZIhvcNAQELBQADggEBAGx++LZIVL2lxSe04cFDOmOJThrfLeLAMPu2ahYf1/Z/RwbZJ5pyuHYXEcR4mghQ9a9nl98sPv3KbfNutCKNBsznT39fx9D16B36gmQXqQI9MIDfr3SXKIy6afOgpCwKm87v45hdapd4OjLxWQVCGj222SH+NHGT0oRLLG9+c32jIcv2FVsAs7nw1gtibvluh5KDD5JQk4lwXv6/f20A66JqN4M0wxpQ9HixrGuR1AsQBx2UWFCgwLhx7tQljTqOiLUbMST85XefzDlZt3l4KGKGGgrt6/Mnj9mokfNNds6CTdGSC8NvcHzu2V2qa8jdgPuI5l3DM4YuO26/IwSK710=" -> (known after apply)
      ~ id                              = "https://quotesappprodkv.vault.azure.net/certificates/cert-appgateway-quotesapp/905e0e40e9984472a53d036b66505341" -> (known after apply)
      ~ key_vault_id                    = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/terraform-backend-rg/providers/Microsoft.KeyVault/vaults/quotesappprodkv" -> (known after apply) # forces replacement
        name                            = "cert-appgateway-quotesapp"
      ~ resource_manager_id             = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/terraform-backend-rg/providers/Microsoft.KeyVault/vaults/quotesappprodkv/certificates/cert-appgateway-quotesapp/versions/905e0e40e9984472a53d036b66505341" -> (known after apply)
      ~ resource_manager_versionless_id = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/terraform-backend-rg/providers/Microsoft.KeyVault/vaults/quotesappprodkv/certificates/cert-appgateway-quotesapp" -> (known after apply)
      ~ secret_id                       = "https://quotesappprodkv.vault.azure.net/secrets/cert-appgateway-quotesapp/905e0e40e9984472a53d036b66505341" -> (known after apply)
        tags                            = {
            "Environment" = "Production"
            "Owner"       = "Rahul"
            "Project"     = "QuotesApp"
        }
      ~ thumbprint                      = "485228EF9BC91C8E8DE20A228601F48CB4FA4FA0" -> (known after apply)
      ~ version                         = "905e0e40e9984472a53d036b66505341" -> (known after apply)
      ~ versionless_id                  = "https://quotesappprodkv.vault.azure.net/certificates/cert-appgateway-quotesapp" -> (known after apply)
      ~ versionless_secret_id           = "https://quotesappprodkv.vault.azure.net/secrets/cert-appgateway-quotesapp" -> (known after apply)

      ~ certificate_policy {
          ~ key_properties {
              + curve      = (known after apply)
                # (4 unchanged attributes hidden)
            }
          ~ lifetime_action {
              ~ trigger {
                  - lifetime_percentage = 0 -> null
                    # (1 unchanged attribute hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ x509_certificate_properties {
              ~ subject            = "CN=app.quotesapp.com, O=Rahul Org" -> "CN=app.quotesapp.com, O=Our Org"
                # (3 unchanged attributes hidden)

              ~ subject_alternative_names {
                  - emails    = [] -> null
                  - upns      = [] -> null
                    # (1 unchanged attribute hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.sql.time_sleep.wait_for_sql will be destroyed
  # (because time_sleep.wait_for_sql is not in configuration)
  - resource "time_sleep" "wait_for_sql" {
      - create_duration = "120s" -> null
      - id              = "2025-09-16T19:24:41Z" -> null
    }

Plan: 2 to add, 3 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @nagarajurahul, Action: `pull_request`*